"""
Вычисление высокосного года
------------------------------------------------------------------------------------------------------------------------
В высокосном годе 366 дней, в обычном 365.

Если год не делится на 4, значит он обычный.
Иначе надо проверить не делится ли год на 100.
Если не делится, значит это не столетие и можно сделать вывод, что год высокосный.
Если делится на 100, значит это столетие и следует проверить его делимость на 400.
Если год делится на 400, то он высокосный.
Иначе год обычный.
"""
year = input("Введите год: ")

year = int(year)

# if year % 4 == 0 or (year % 100 == 0 and year % 400 != 0):
#     print(f'Год {year} является высокосным')
# else:
#     print(f'Год {year} не высокосный')

if year % 4 != 0 or (year % 100 == 0 and year % 400 != 0):
    print(f'Год {year} не является высокосным')
else:
    print(f'Год {year} является высокосный')
